/*Задание 1. Я хочу измерить скорости двух вариантов кода: с использованием
`switch` и с использованием`if`. Так как выполнение одного блока, или даже 
десяти, займет всего лишь долю милисекунды, и на процессоре это практически 
не скажется, то замерять нужно выполнение тысячи блоков, или может даже миллиона
блоков. Делать подобный скрипт в ручную не выглядит интересно :) Потому мне бы
хотелось чтобы вы написали код который будет создавать 2 функции: первая - с
одним блоком `switch` но с `N` блоками `case`; вторая функция должна содержать
эквивалентную конструкцию из блоков `if`. А после создания нужно выполнить обе 
функции несколько раз, таким образом чтобы в конце концов были задействованы по 
одному разу все секции `case` (ну и все блоки `if`). Длительность выполнения всех
вызовов каждой функции нужно измерить с помощью
https://developer.mozilla.org/en-US/docs/Web/API/Console/time . 
Немного поспойлерю. Вам нужно будет в цикле конкатенировать строки, воспользоваться
конструкцией `new Function`, и посмотреть документацию к методу `console.timeEnd`.
(edited)

1) Перш за все повинна бути якась змінна в котрій міститиметься кількість блоків
(`case` чи `if`) які потрібно згененрувати. Відповідно подальшщий код повинен бути
написаний таким чином що при змінні значення цієї змінної не доводилося ніго більше
змінюватип.
2) В циклі згенерувати рядок який по суті буде кодом згенерованим із блоків `switch/case` 
чи `if`, цей рядок буде змінювати довжину відповідно до змінної із першого пункту.
3) Створити функцію що буде приймати один аргумент. Тілом функціі має бути рядок 
згенерований в другому пункті. Аргумент функціі повинен використовуватися як ключ 
для `switch/case` чи в умовах `if` для вибору відповідного блоку.
4) Викликати функцію стільки ж разів скільки блоків `switch/case` чи `if`, викликати
так щоб в кінці було вибрано кожен блок по одному разу. Виміряти час потрібний на
виконання усієї черги викліків функції із `switch/case`, і відповідно виміряти час 
для черги із `if`. Щось на зразок наступного:
//Якщо у вас згенеровано функцію із трьома блооками то алгоритм вимірювання виглядатиме приблизно так:

//тут почак вимірювання
functionWithSwitch(1);
functionWithSwitch(2);
functionWithSwitch(3);
// тут кінець вимірювання

//тут почак вимірювання
functionWithIf(1);
functionWithIf(2);
functionWithIf(3);
// тут кінець вимірювання */

function generateIf(number) {
    var body = '';
    for (var i=1;i<=number;i++) {
     body +='if (value == '+i+') { return '+i+'; }; ';
    }
    return new Function('value', body);
}


function generateSwitch(number) {
    var body ='';
    for (var i = 1; i <= number; i++) {
        body += 'case ' + i + ': return ' + i + ';';
    }
    var body2 = ' switch (value) { ' + body + ' }; ';
    return new Function('value', body2);
}

var myF = generateIf(200000);
var myF2 = generateSwitch(200000);

console.log('IFs:');
console.time('time');
myF(199999);
console.timeEnd('time');

console.log('SWITCHs:');
console.time('time');
myF2(199999);
console.timeEnd('time');

//or

var time = performance.now();
myF(199999);
var time1 = performance.now();

console.log('время работы IFs:', (time1 - time).toFixed(3) );

var time2 = performance.now();
myF2(199999);
var time3 = performance.now();

console.log('время работы SWITCHs:', (time3 - time2).toFixed(3) );

